{
    "name": "IOANNIS SAVVAIDIS",
    "title": "Computer Engineer and Composer",
    "email": "johnsavvaidis@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/ioannissavvaidis/",
    "github": "https://github.com/ioaiaaii",
    "profile": "Computer Engineer and Composer dedicated to building sustainable systems and exploring the intersection of technology and art. Experienced in managing large-scale production infrastructures with a focus on observability and performance while cultivating a culture of respect and collaboration.",
    "artistBio": "Composer drawing on Quantum and Distributed Computing principles to interpret relativistic reality with motion dynamics. Discography with record labels including Anopolis, June, Lower Parts, and Phormix. Performs live with synthesizers under an improvisational approach.",
    "engineerBio": "Computer Engineer with over a decade in Systems and Site Reliability Engineering, managing large-scale production infrastructures. Focused on systems performance, software engineering, and cultivating a culture of collaboration and continuous improvement. Interested in physics and music composition. Currently, pursuing a Master's in Quantum Computing.",
    "artisticApproach": "Drawing from a Computer Engineering background, emerged into music, experimenting with the concept of 'Tensor Music'. An approach that explores vector spaces and their interactions, shaping multidimensional spaces. Currently focused on 'Superluminal Motion', inspired by theoretical faster-than-light phenomena, where spacetime intersects across non-local states.",
    "selectedWorks": [
      {
        "title": "\"Diataxis\" (June Records, 2019)",
        "link": "https://ioannissavvaidis.bandcamp.com/album/diataxis"
      },
      {
        "title": "\"Superluminal Motion\" (Unreleased, 2021-2024)",
        "link": "https://on.soundcloud.com/hFMepUAdjMh53FVR8"
      },
      {
        "title": "\"Δέσμη Φωτός\" (Unreleased, 2021-2024)",
        "link": "https://on.soundcloud.com/oEv8WErALuHexf5v8"
      }
    ],
    "collaborations": [
      {
        "title": "\"SACRED TALES/COVID-19\" by Aemilia Papaphilippou (Athens Epidaurus Festival, 2021), Short Composition",
        "link": "https://aefestival.gr/festival_events/sacred-tales-covid-19/?lang=en"
      },
      {
        "title": "\"Stone Age\" by Joshua Olsthoorn (Film, 2022), Film Scoring",
        "link": "https://typical-organization.com/portfolio/studio-stone-age/"
      }
    ],
    "experience": [
      {
        "role": "Senior Site Reliability Engineer",
        "company": "TileDB",
        "location": "Remote",
        "startDate": "Jan 2023",
        "endDate": "Mar 2024",
        "description": [
          "Sole SRE for half of my tenure, managing infrastructure stability across multiple AWS regions and supporting critical business operations",
          "Introduced pre-commit hooks, conventional commits, and SRE practices",
          "Served as primary contact for production incidents, creating RFCs and RCAs to enhance performance and facilitate troubleshooting",
          "Streamlined the monitoring process by simplifying Prometheus/Grafana manifest deployment, adding dashboards, alerts, and runbooks for more effective observability and on-call response",
          "Enhanced Cluster Autoscaler and AWS ASGs, improving spot instance reliability and enabling multi-zonal clustering",
          "Leveraged monitoring insights to reorganize infrastructure and enhance scaling by creating dedicated node groups and fine-tuning ASG node sizes based on workload characterization",
          "Reduced CloudWatch and EC2 costs by optimizing resource usage and configurations",
          "Automated, documented, and led Kubernetes upgrades (1.21 → 1.26) on self-managed node groups, ensuring smooth workload migrations",
          "Advocated for Product’s smoke testing, profiling, and microservices pattern",
          "Initiated and led the SRE roadmap focusing on performance, observability, and release engineering improvements, and SLIs/SLOs adaption"
        ]
      },
      {
        "role": "Senior Site Reliability Engineer",
        "company": "Sitecore",
        "location": "Remote",
        "startDate": "May 2022",
        "endDate": "Dec 2022",
        "description": [
          "SRE Advocate in DevOps team, to enable Observability",
          "Introduced SRE principles to support product adaptation, presenting the SRE discipline to directors and stakeholders"
        ]
      },
      {
        "role": "Senior Site Reliability Engineer",
        "company": "Beat",
        "location": "ATH",
        "startDate": "Apr 2019",
        "endDate": "Apr 2022",
        "description": [
          "Member of SRE team, managing infrastructure across multiple AWS regions (~500 instances) with over 70 microscervices and self-managed Kubernetes Clusters",
          "Managed observability and release engineering, establishing centralized metrics, logging, tracing, and CI/CD systems with SLIs/SLOs",
          "Led migration from Docker Registry and Chartmuseum to Harbor Registry",
          "Developed CLI to deploy Prometheus and Grafana manifests with GitOps",
          "Led SSO provisioning for AWS with OneLogin",
          "Contributed to a Go-based orchestration tool for (~70) microservices CI/CD, enabling Kubernetes sandbox environments",
          "Contributed to reducing alert noise and improving infrastructure documentation"
        ]
      },
      {
        "role": "Systems Engineer",
        "company": "Upstream",
        "location": "ATH",
        "startDate": "Sep 2014",
        "endDate": "Mar 2019",
        "description": [
          "First professional role managing large-scale on-prem VMware infrastructure ~(300 servers, 5 storage systems, 5K VMs across 3 DCs)",
          "Maintained reverse proxies, DNS, Linux VM templates, and monitoring",
          "Automated cost reporting and VM lifecycle management",
          "Introduced resource tagging and openDCIM for infrastructure inventory",
          "Led the migration of production traffic from Apache to NGINX farms"
        ]
      },
      {
        "role": "Systems Engineer",
        "company": "UOM",
        "location": "SKG",
        "startDate": "Aug 2013",
        "endDate": "Jan 2014",
        "description": [
          "Designed the fist University’s IaaS Community Cloud as an extension of my bachelor’s dissertation",
          "Delivered a private cloud using Synnefo (3 servers and 1 storage system), for academic compute and storage needs"
        ]
      }
    ],
    "education": [
      {
        "degree": "MSc in Quantum Computing and Quantum Technologies",
        "institution": "Democritus University of Thrace",
        "location": "Remote",
        "startDate": "Oct 2023",
        "endDate": "Present",
        "specialization": "Specialization in Linear Algebra, Quantum Systems and Algorithms",
        "dissertation": "Thesis topic on Interface between Quantum and Classical Computers"        
      },
      {
        "degree": "BSc in Applied Informatics",
        "institution": "University of Macedonia",
        "location": "SKG",
        "startDate": "Sep 2006",
        "endDate": "Feb 2013",
        "specialization": "Specialization in OOP, OS, Networks, and Distributed Systems",
        "dissertation": "Dissertation on Cloud Computing with OpenStack"
      }
    ],
    "projects": [
      {
        "title": "micro-infra",
        "description": "Lightweight GCP Infrastructure, featuring self-managed observability and essential services stack.",
        "link": "GitHub Link"
      },
      {
        "title": "repo-operator",
        "description": "Modular repository management tool for hermetic builds.",
        "link": "GitHub Link"
      },
      {
        "title": "ioaiaaii.net",
        "description": "BFF with Go and Vue.js, hosted at micro-infra, powered by repo-operator.",
        "link": "GitHub Link"
      }
    ],
    "skillGroups": [
      {
        "category": "Site Reliability Engineering",
        "skills": ["Systems Performance", "SLIs/SLOs", "Release Engineering", "Incident and Toil Management"]
      },
      {
        "category": "Infrastructure",
        "skills": ["AWS", "GCP", "VMware"]
      },
      {
        "category": "IAC",
        "skills": ["Terraform","Terragrunt", "Ansible"]
      },
      {
        "category": "Kubernetes",
        "skills": ["EKS/GKE", "Ingress-NGINX", "Cluster Autoscaler", "Cert Manager", "Helm"]
      },      
      {
        "category": "Observability",
        "skills": ["Prometheus","Thanos", "Grafana", "Tempo", "Loki", "Pyroscope", "OpenTelemetry", "OpenSearch", "On-Call", "OpenCost", "core-dump-handler", "Mixins"]
      },
      {
        "category": "GitOps",
        "skills": ["ArgoCD","GitHub Actions","GitLab CI/CD"]
      },
      {
        "category": "Containers",
        "skills": ["Docker","Kaniko", "Dive"]
      },      
      {
        "category": "Services",
        "skills": ["Harbor Registry","NGINX", "BIND"]
      },
      {
        "category": "Security",
        "skills": ["Trivy","ModSecurity"]
      },      
      {
        "category": "Programming",
        "skills": ["Bash", "Golang", "Python"]
      },
      {
        "category": "Quantum Computing",
        "skills": ["Qiskit", "Quantum Algorithms", "Quantum Networks"]
      }      
    ]
  }
