{
    "name": "IOANNIS SAVVAIDIS",
    "title": "Computer Engineer and Composer",
    "email": "johnsavvaidis@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/ioannissavvaidis/",
    "github": "https://github.com/ioaiaaii",
    "profile": "Computer Engineer and Composer dedicated to building sustainable systems and exploring the intersection of technology and art. Experienced in managing large-scale production infrastructures with a focus on observability and performance while cultivating a culture of respect and collaboration.",
    "artistBio": "Composer drawing on Quantum and Distributed Computing principles to interpret relativistic reality. Discography with record labels including Anopolis, June, Lower Parts, and Phormix. Performs live with synthesizers under an improvisational approach.",
    "engineerBio": "Computer Engineer experienced in Systems and Site Reliability Engineering, managing large-scale production infrastructures. Focused on systems performance, software engineering, and cultivating a culture of collaboration and continuous improvement. Interested in physics and music composition. Currently, pursuing a Master's in Quantum Computing.",
    "artisticApproach": "Drawing from a Computer Engineering background, emerged into music, experimenting with the concept of 'Tensor Music'. An approach that explores vector spaces and their interactions, shaping multidimensional spaces. Currently focused on apparent Superluminal Motion and Quantum nonlocality.",
    "selectedWorks": [
      {
        "title": "\"Diataxis\" (June Records, 2019)",
        "link": "https://ioannissavvaidis.bandcamp.com/album/diataxis"
      },
      {
        "title": "\"Superluminal Motion\" (Unreleased, 2021-2025)",
        "link": "https://on.soundcloud.com/yBsywY8J3b9UkXPY9"
      },
      {
        "title": "\"Δέσμη Φωτός\" (Unreleased, 2021-2024)",
        "link": "https://on.soundcloud.com/oEv8WErALuHexf5v8"
      }
    ],
    "collaborations": [
      {
        "title": "\"SACRED TALES/COVID-19\" by Aemilia Papaphilippou (Athens Epidaurus Festival, 2021), Short Composition",
        "link": "https://aefestival.gr/festival_events/sacred-tales-covid-19/?lang=en"
      },
      {
        "title": "\"Stone Age\" by Joshua Olsthoorn (Film, 2022), Film Scoring",
        "link": "https://typical-organization.com/portfolio/studio-stone-age/"
      }
    ],
    "experience": [
      {
        "role": "Site Reliability Engineer",
        "company": "Independent Research",
        "location": "Remote",
        "startDate": "Apr 2024",
        "endDate": "Present",
        "description": [
          "Architected three open-source GitHub projects for production-grade cloud infrastructure & microservices, strengthening expertise in Infrastructure as Code, Systems Performance, and Software Engineering.",
          "Completed MSc coursework, deepening knowledge in Computer Engineering and Physics.",
          "Developing a Kubernetes operator for quantum-classical hybrid computing, enabling cloud-native orchestration, novel OpenTelemetry observability approach, and dynamic scheduling across IBM QPUs."
        ]
      },      
      {
        "role": "Senior Site Reliability Engineer",
        "company": "TileDB",
        "location": "Remote",
        "startDate": "Jan 2023",
        "endDate": "Mar 2024",
        "description": [
          "Owned reliability efforts for TileDB Cloud, managing 5 EKS & RDS clusters, leading RCAs, and influencing cross-team decisions; sole SRE for 8 months, building team culture, backlog, and roadmap.",
          "Created a strategy to reduce Toil, scale IaC, Kubernetes, RDS, and TileDB Cloud products, and introduce multi-cloud, release engineering, and SLO frameworks to improve system resilience and SRE culture.",
          "Redesigned 300+ Auto Scaling Groups into 5 workload-dedicated groups with EC2 interruption handling and Multi-AZ support, managing bursty CPU/GPU requests (0-50+ pods/sec), mitigating scaling issues.",
          "Optimized Kubernetes deployments, fine-tuning HPA, resource allocation, and multi-zone scheduling, increasing cluster utilization from ~20% to ~70%, cutting EC2 costs, and improving uptime.",
          "Executed EKS upgrades (1.21 to 1.26) in self-managed node groups, creating shell-scripted and documented procedures, ensuring a reproducible and seamless process for engineering teams.",
          "Improved monitoring systems, adding dashboards and actionable alerts, reducing alert noise by ~80%, mentoring engineers in SRE, and elevating team-wide incident response and observability standards.",
          "Orchestrated five microservice migrations, integrating an API Gateway, adding profiling, optimizing container signal handling, and developing Helm helpers for maintainable configurations.",
          "Revamped IaC, improving codebase maintainability & documentation; cut AWS CloudTrail cost by ~50%."
        ]
      },
      {
        "role": "Senior Site Reliability Engineer",
        "company": "Sitecore",
        "location": "Remote",
        "startDate": "May 2022",
        "endDate": "Dec 2022",
        "description": [
          "Collaborated with leadership to establish the SRE function; added product telemetry and monitoring."        ]
      },
      {
        "role": "Senior Site Reliability Engineer",
        "company": "FreeNow (formerly BEAT)",
        "location": "ATH",
        "startDate": "Apr 2019",
        "endDate": "Apr 2022",
        "description": [
          "Established SLO-driven observability with Thanos, Tempo, Loki, and Grafana across 6 Kubernetes clusters (500+ nodes, 70+ microservices), tracking thousands of requests per second across LATAM.",
          "Migrated production traffic of six Docker Registries and ChartMuseums to a centralized Harbor Registry, enhancing container security scanning, adding RBAC, and reducing image pull times and storage costs.",
          "Built two Go-based tools to orchestrate microservices CI/CD, integrating GitHub Actions, reusable workflows, and ArgoCD across 70+ repositories, boosting developer productivity and GitOps adoption.",
          "Implemented SSO provisioning for AWS with OneLogin, improving access management for 200+ users.",
          "Developed internal documentation, a central knowledge base, and contributed to hiring and onboarding."
        ]
      },
      {
        "role": "Systems Engineer",
        "company": "Upstream",
        "location": "ATH",
        "startDate": "Sep 2014",
        "endDate": "Mar 2019",
        "description": [
          "Managed on-prem hybrid infrastructure across 3 Data Centers & AWS, overseeing 300+ bare-metal servers, 5K+ VMs, and Kubernetes clusters; administered Linux, Reverse Proxy, and authoritative DNS.",
          "Led cross-team automation (Systems, Networks, PMs), standardizing VM lifecycle and specifications, cutting provisioning SLA from 3d to 3h, enabling on-demand requests and boosting operational efficiency.",
          "Optimized resource utilization by consolidating VMs across hypervisors, executing capacity planning, and introducing openDCIM, phpIPAM, VMTurbo, and cost reporting.",
          "Migrated production traffic to NGINX RP farms, improving security and performance."
        ]
      },
      {
        "role": "Systems Engineer",
        "company": "UOM",
        "location": "SKG",
        "startDate": "Aug 2013",
        "endDate": "Jan 2014",
        "description": [
          "Designed the fist University’s IaaS Community Cloud; delivered a private cloud using Synnefo (3 servers and 1 storage system)."
        ]
      }
    ],
    "education": [
      {
        "degree": "MSc in Quantum Computing and Quantum Technologies",
        "institution": "Democritus University of Thrace",
        "location": "Remote",
        "startDate": "Oct 2023",
        "endDate": "Present",
        "specialization": "Specialization in Linear Algebra, Quantum Systems and Algorithms",
        "dissertation": "Thesis topic on Interface between Quantum and Classical Computers"        
      },
      {
        "degree": "BSc in Applied Informatics",
        "institution": "University of Macedonia",
        "location": "SKG",
        "startDate": "Sep 2006",
        "endDate": "Feb 2013",
        "specialization": "Specialization in  Object-oriented programming, Operating Systems, Networks, and Distributed Computing",
        "dissertation": "Dissertation on Cloud Computing with OpenStack"
      }
    ],
    "projects": [
      {
        "title": "micro-infra",
        "description": "Lightweight GCP private infrastructure running production GKE with Terragrunt and Argo CD, including a self-managed core services stack, automated vulnerability scanning, and a WAF.",
        "link": "GitHub Link"
      },
      {
        "title": "repo-operator",
        "description": "Modular repository management tool for hermetic builds.",
        "link": "GitHub Link"
      },
      {
        "title": "ioaiaaii.net",
        "description": "Live Kubernetes-native API for a personal portfolio using Golang, Vue.js, and OpenTelemetry, with fully automated CI/CD pipelines and GitOps workflows in a private GKE environment. Hosted at micro-infra, powered by repo-operator.",
        "link": "GitHub Link"
      }
    ],
    "skillGroups": [
      {
        "category": "Physical Infrastructure & Virtualization",
        "skills": ["Data Center Operations", "DELL PowerEdge Servers", "EMC XtremIO/Unity Storages", "VMware vSphere"]
      },
      {
        "category": "Cloud Platforms",
        "skills": ["AWS (EC2, VPC, RDS, IAM, SNS, S3, KMS)", "GCP (VPC, IAM, GCR)", "OpenStack"]
      },      
      {
        "category": "Infrastructure as Code (IaC)",
        "skills": ["Terraform", "Terragrunt", "Atlantis", "Ansible"]
      },      
      {
        "category": "Kubernetes Ecosystem",
        "skills": ["EKS", "GKE", "Ingress-NGINX", "Cluster Autoscaler", "cert-manager", "Harbor Registry"]
      },
      {
        "category": "Containerization",
        "skills": ["Docker", "Kaniko", "Dive", "Distroless"]
      },
      {
        "category": "Monitoring",
        "skills": ["Prometheus", "Thanos", "Grafana", "Tempo", "Loki", "Pyroscope", "CloudWatch", "CloudTrail"]
      },      
      {
        "category": "Observability",
        "skills": ["OpenTelemetry","SLO"]
      },
      {
        "category": "Incident Management",
        "skills": ["On-call shifts", "Blameless Postmortems", "Retrospectives", "Runbooks"]
      },      
      {
        "category": "DevOps Tools",
        "skills": ["GitHub Actions", "GitLab CI/CD", "ArgoCD"]
      },
      {
        "category": "Operating Systems",
        "skills": ["Linux (CentOS, Ubuntu)", "macOS"]
      },      
      {
        "category": "Networking",
        "skills": ["TCP/IP", "HTTP", "DNS"]
      },
      {
        "category": "Security & Compliance",
        "skills": ["IAM Management", "SOC 2", "CIS AWS", "Trivy", "ModSecurity"]
      },      
      {
        "category": "Programming",
        "skills": ["Bash", "Golang", "Python"]
      },
      {
        "category": "Documentation",
        "skills": ["MKDocs", "D2 (diagram scripting)"]
      },      
      {
        "category": "Quantum Computing",
        "skills": ["Qiskit", "Quantum Algorithms", "Quantum Networks"]
      }      
    ]
  }
