{
    "projects": [                  
        {
            "title": "ioaiaaii.net",
            "description": "Live Kubernetes-native API for a personal portfolio using Golang, Vue.js, and OpenTelemetry, with fully automated CI/CD pipelines and GitOps workflows in a private GKE environment. Hosted at micro-infra, powered by repo-operator.",
            "link": "https://github.com/ioaiaaii/ioaiaaii.net?tab=readme-ov-file#ioaiaaiinet",
            "category": "Classical"
        },
        {
            "title": "micro-infra",
            "description": "Lightweight GCP private infrastructure running production GKE with Terragrunt and Argo CD, including a self-managed core services stack, automated vulnerability scanning, and a WAF.",
            "link": "https://github.com/ioaiaaii/micro-infra?tab=readme-ov-file#micro-infra",
            "category": "Classical"
        },
        {
            "title": "repo-operator",
            "description": "A modular repository management tool that streamlines workflows with Docker-based, hermetic Makefile targets, ensuring isolated, reproducible builds and tests. It can be added as a Git submodule to standardize operations like building, testing, and documentation across repositories.",
            "link": "https://github.com/ioaiaaii/repo-operator?tab=readme-ov-file#-repo-operator-",
            "category": "Classical"
        },
        {
            "title": "GoDuckDuckGo",
            "description": "A set of microservices that answer client queries by interacting with DuckDuckGo’s API. This WIP playground focuses on learning Golang, Software Engineering, and Systems Design within the SRE discipline.",
            "link": "https://github.com/ioaiaaii/goduckduckgo?tab=readme-ov-file#goduckduckgo",
            "category": "Classical"
        },
        {
            "title": "Quantum Teleportation",
            "description": "An essay on the teleportation protocol, a foundational principle in quantum mechanics that enables quantum state transfer between distant systems using entanglement. It delves into theoretical foundations and demonstrates the protocol’s implementation in Qiskit.",
            "link": "https://github.com/ioaiaaii/quantum-computing-research/blob/main/Teleportation/Teleportation.pdf",
            "category": "Quantum"
        },
        {
            "title": "Deutsch's Algorithm",
            "description": "An analysis of Deutsch’s Algorithm, showcasing its mathematical basis as the first quantum algorithm to demonstrate quantum advantage. The essay includes an implementation in Qiskit, executed on actual quantum systems.",
            "link": "https://github.com/ioaiaaii/quantum-computing-research/blob/main/Deutsch/Deutsch_argorithm.pdf",
            "category": "Quantum"
        },
        {
            "title": "Grover's Algorithm",
            "description": "An analysis of Grover’s search algorithm, presenting its mathematical framework and illustrating its quadratic speedup for unstructured searches. The essay features Qiskit executions on real quantum hardware.",
            "link": "https://github.com/ioaiaaii/quantum-computing-research/blob/main/Grover/Grover.pdf",
            "category": "Quantum"
        },
        {
            "title": "Shor's Algorithm",
            "description": "A report on Shor’s factorization algorithm, examining its mathematical principles and implications for cryptography. The essay concludes with an implementation in Qiskit, executed on physical quantum hardware.",
            "link": "https://github.com/ioaiaaii/quantum-computing-research/blob/main/Shor/Shor.pdf",
            "category": "Quantum"
        },
        {
            "title": "Unconventional Computing Review",
            "description": "A literature review on emerging computing paradigms for the Fourth Industrial Revolution, addressing the limitations of Moore’s Law. It explores reversible, optical, and soliton-based computing as alternatives to conventional methods.",
            "link": "https://github.com/ioaiaaii/quantum-computing-research/blob/main/UNCOMP/Literature_Survey_for_Unconventional_Computing_Ioannis_Savvaidis.pdf",
            "category": "Quantum"
        }                           
    ]
}
